[
  "obsidian42-brat",
  "Enhanced-editing",
  "buttons",
  "file-tree-alternative",
  "dataview",
  "obsidian-excalidraw-plugin",
  "excalibrain",
  "templater-obsidian",
  "quickadd",
  "obsidian-file-path-to-uri",
  "table-extended",
  "table-editor-obsidian",
  "sheets",
  "editing-toolbar",
  "obsidian-image-toolkit",
  "obsidian-file-link",
  "obsidian-icon-folder",
  "number-headings-obsidian",
  "link-favicon",
  "obsidian-link-embed",
  "link-preview"
]